---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.FinishedStreams
source: html/1982859e-6c03-40c8-3816-eede2eed6d68.htm
---
# Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.FinishedStreams Property

The number of streams finished since the last time this event was raised.

## Syntax (C#)
```csharp
public int FinishedStreams { get; }
```